//=============================================================================
//
// デバッグ表示処理 [debugproc.cpp]
// Author : RIKU TANEKAWA
//
//=============================================================================

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "debugproc.h"
#include "renderer.h"
#include "manager.h"

//*****************************************************************************
// 静的メンバ変数宣言
//*****************************************************************************
LPD3DXFONT CDebugProc::m_pFont = nullptr;
char CDebugProc::m_aStr[1024] = {};

//=============================================================================
// コンストラクタ
//=============================================================================
CDebugProc::CDebugProc()
{
	// 値のクリア

}
//=============================================================================
// デストラクタ
//=============================================================================
CDebugProc::~CDebugProc()
{
	// なし
}
//=============================================================================
// 初期化処理
//=============================================================================
void CDebugProc::Init(void)
{
	// デバイスの取得
	LPDIRECT3DDEVICE9 pDevice = CManager::GetRenderer()->GetDevice();

	// デバッグ表示用フォントの生成
	D3DXCreateFont(pDevice, 18, 0, 0, 0,
		FALSE, SHIFTJIS_CHARSET,
		OUT_DEFAULT_PRECIS, DEFAULT_QUALITY, DEFAULT_PITCH,
		"Terminal", &m_pFont);

	// バッファのクリア
	memset(m_aStr, 0, sizeof(m_aStr));
}
//=============================================================================
// 終了処理
//=============================================================================
void CDebugProc::Uninit(void)
{
	// デバッグ表示用フォントの破棄
	if (m_pFont != nullptr)
	{
		m_pFont->Release();

		m_pFont = nullptr;
	}
}
//=============================================================================
// 情報の更新処理
//=============================================================================
void CDebugProc::UpdateInfo(void)
{



}
//=============================================================================
// 表示処理
//=============================================================================
void CDebugProc::Print(const char* fmt, ...)
{
	va_list args;

	va_start(args,fmt);

	vsnprintf(m_aStr, sizeof(m_aStr),fmt, args);

	va_end(args);
}
//=============================================================================
// 描画処理
//=============================================================================
void CDebugProc::Draw(D3DXCOLOR col, int posX, int posY)
{
	RECT rect = { posX,posY, SCREEN_WIDTH, SCREEN_HEIGHT };

	//テキストの描画
	m_pFont->DrawTextA(NULL, &m_aStr[0], -1, &rect, DT_LEFT, col);

	// バッファのクリア
	memset(m_aStr, 0, sizeof(m_aStr));
}
