//=============================================================================
//
// デバッグ表示処理 [debugproc.h]
// Author : RIKU TANEKAWA
//
//=============================================================================
#ifndef _DEBUGPROC_H_// このマクロ定義がされていなかったら
#define _DEBUGPROC_H_// 2重インクルード防止のマクロ定義

//*****************************************************************************
// インクルードファイル
//*****************************************************************************

//*****************************************************************************
// デバッグクラス
//*****************************************************************************
class CDebugProc
{
public:
	CDebugProc();
	~CDebugProc();

	void Init(void);
	void Uninit(void);
	void UpdateInfo(void);
	static void Print(const char* fmt, ...);
	static void Draw(D3DXCOLOR col,int posX,int posY);

private:
	static LPD3DXFONT m_pFont;	// フォントへのポインタ
	static char m_aStr[1024];	// 文字列を格納するバッファ

};
#endif