//=============================================================================
//
// ゲームオーバー処理 [gameover.cpp]
// Author : RIKU TANEKAWA
//
//=============================================================================

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "gameover.h"
#include "input.h"
#include "manager.h"
#include "background.h"

//=============================================================================
// コンストラクタ
//=============================================================================
CGameOver::CGameOver() : CScene(CScene::MODE_GAMEOVER)
{
	// 値のクリア
}
//=============================================================================
// デストラクタ
//=============================================================================
CGameOver::~CGameOver()
{
	// なし
}
//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CGameOver::Init(void)
{
	// マウスカーソルを表示する
	CManager::GetInputMouse()->SetCursorVisibility(true);

	// 背景の生成
	CBackground::Create(D3DXVECTOR3(960.0f, 540.0f, 0.0f), 260.0f, 80.0f, "data/TEXTURE/.png");

	return S_OK;
}
//=============================================================================
// 終了処理
//=============================================================================
void CGameOver::Uninit(void)
{
	// なし
}
//=============================================================================
// 更新処理
//=============================================================================
void CGameOver::Update(void)
{
	CInputMouse* pInputMouse = CManager::GetInputMouse();
	CInputJoypad* pJoypad = CManager::GetInputJoypad();
	CFade* pFade = CManager::GetFade();

	if (pFade->GetFade() == CFade::FADE_NONE && (pInputMouse->GetTrigger(0) || pJoypad->GetTrigger(CInputJoypad::JOYKEY_A)))
	{
		// タイトル画面に移行
		pFade->SetFade(MODE_TITLE);
	}

#ifdef _DEBUG
	if (pFade->GetFade() == CFade::FADE_NONE && CManager::GetInputKeyboard()->GetTrigger(DIK_RETURN))
	{
		// タイトル画面に移行
		pFade->SetFade(MODE_TITLE);
	}
#endif
}
//=============================================================================
// 描画処理
//=============================================================================
void CGameOver::Draw(void)
{


}
