//=============================================================================
//
// ゲームオーバー処理 [gameover.h]
// Author : RIKU TANEKAWA
//
//=============================================================================
#ifndef _GAMEOVER_H_// このマクロ定義がされていなかったら
#define _GAMEOVER_H_// 2重インクルード防止のマクロ定義

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "scene.h"

//*****************************************************************************
// ゲームオーバークラス
//*****************************************************************************
class CGameOver : public CScene
{
public:
	CGameOver();
	~CGameOver();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

private:

};

#endif
