//=============================================================================
//
// GUI情報表示処理 [guiInfo.h]
// Author : RIKU TANEKAWA
//
//=============================================================================
#ifndef _GUIINFO_H_
#define _GUIINFO_H_

//*****************************************************************************
// インクルードファイル
//*****************************************************************************

//*****************************************************************************
// GUI情報表示クラス
//*****************************************************************************
class CGuiInfo
{
public:

	// プレイヤーのデバッグ情報の表示
	static void PlayerInfo(void);

	// 敵のデバッグ情報の表示
	static void EnemyInfo(void);

	// 学習AI情報の表示
	static void AIInfo(void);

	// カメラのデバッグ情報の表示
	static void CameraInfo(void);
};

#endif

